Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/state_examinations/established_leaving_certificate.html.txt.tmx
Source language: en
Languages: ga

source: Most Senior Cycle students choose the established Leaving Certificate programme
ga: Roghnaíonn an chuid is mó de scoláirí na hArdteistiméireachta an Ardteistiméireacht Bhunaithe

source: This 2-year programme covers a wide range of subjects
ga: Is clár 2 bhliain é an Ardteistiméireacht Bhunaithe

source: Subjects are normally studied at either Ordinary or Higher Level
ga: Déantar staidéar ar na hábhair go hiondúil ag gnáthleibhéal nó ardleibhéal

source: Two subjects, Irish and Mathematics, can be studied at Foundation Level
ga: Is féidir staidéar a dhéanamh ar dhá ábhar (Matamatic agus Gaeilge) ag bunleibhéal

source: Foundation Level is geared to the needs of students who might have difficulty with those subjects at Ordinary or Higher Level
ga: Tá an bunleibhéal bunaithe ar riachtanais scoláirí a bhfuil deacracht acu leis an gnáthleibhéal nó ardleibhéal sna hábhair sin

source: Students normally study 6 or 7 subjects during the Senior Cycle
ga: Go hiondúil déanann scoláirí staidéar ar 6 nó 7 ábhar sa tSraith Sinsearach

source: If they are following the established Leaving Certificate programme they must take at least 5 subjects, including Irish
ga: Caithfidh siad 5 ábhar ar a laghad, Gaeilge san áireamh a roghnú le haghaidh na Ardteistiméireachta Bunaithe

source: In choosing Leaving Certificate subjects, students should take note of subjects that they may need for the third-level courses of their choice
ga: Ag roghnú ábhar don Ardteistiméireacht, ba cheart go dtógfadh scoláirí suntas do na hábhair a bheas ag teastáil uathu don chúrsa triú leibhéil atá roghnaithe acu

source: For example, a student who hopes to get a place on a course at one of the universities that make up the National University of Ireland must meet a minimum entry requirement of 6 subjects, including English, Irish and a third language, 2 of which must be at Grade C on a Higher Level paper
ga: Mar shampla, an scoláire atá ag iarraidh áit a fháil i gceann de na h0llscoileanna atá mar chuid de Ollscoil Náisiúnta na hÉireann, caithfidh sé 6 ábhar a bheith aige, Béarla, Gaeilge agus teanga eile san áireamh, agus caithfidh péire acu a bheith ina nGrád C ar pháipéar ardleibhéil

source: The school guidance counsellor will have the information about the subject requirements for each third-level course
ga: Beidh an t-eolas maidir leis na hábhair is gá le haghaidh gach cúrsa tríú leibhéil ag an treoirchomhairleoir

source: The legal school-leaving age is 16 years
ga: Is í 16 bliana an aois dhlíthiúil chun an scoil a fhágáil

source: The National Council for Curriculum and Assessment provides a list of Leaving Certificate subjects
ga: Cuireann an Chomhairle Náisiúnta Curaclaim agus Measúnachta liosta ábhar Ardteistiméireachta ar fáil

source: Leaving Certificate students may take the Junior Certificate programme in French, German, Spanish or Italian as part of their approved Senior Cycle course, if their schools offer this option
ga: Féadfaidh mic léinn Ardteistiméireachta clár an Teastais Shóisearaigh sa Fhraincis, sa Spáinnis nó san Iodáilis mar chuid dá gcúrsa ceadaithe Sraithe Sinsearaí, má thairgeann an scoil an rogha sin

source: The established Leaving Certificate is assessed through a written examination at the end of the 2-year programme
ga: Déantar an Ardteistiméireacht bhunaithe a mheasúnú le scrúdú scríofa ag deireadh an chláir 2 bhliain

source: There are practical examinations and project work in certain subjects, such as Art, Construction Studies and Engineering
ga: Tá scrúduithe praiticiúla agus obair thionscadail i gceist in ábhair áirithe mar shampla Ealaín, Staidéar Foirgníochta agus Innealtóireacht

source: There are oral examinations in Irish and continental languages
ga: Tá béaltrialacha ann sa Ghaeilge agus i dteangacha na Mór-Roinne

source: The practical and oral tests take place during the final year of the programme
ga: Tarlaíonn na scrúduithe praiticiúla agus na béaltrialacha i rith bliana deiridh an chláir

source: The written examination is held in June each year
ga: Bíonn an scrúdú scríofa ann i Mí an Mheithimh gach bliain

source: Marking system for examination grades
ga: Córas marcála le haghaidh grád scrúduithe

source: There is a new grading scheme for the Leaving Certificate in 2017
ga: Tá scéim mharcála nua don Ardteistiméireacht i 2017

source: The new scale has 8 grades, the highest grade is Grade 1 and the lowest grade is Grade 8
ga: Tá 8 ngrád ag an scála nua, an grád is airde ná Grád 1, agus an grád is ísle ná Grád 8

source: The new 8-point grading scale replaces the 14-point scale at both Higher and Ordinary levels
ga: Tagann an scála grádaithe nua de 8 bpointe in áit an scála 14 pointe ag Ardleibhéil agus Bunleibhéil

source: Marks between 100% to 30% are divided into seven grade bands (1-7)
ga: Roinntear marcanna idir 100% go 30% i seacht rann gráid (1-7)

source: Each band is 10% wide
ga: Tá gach rann 10% leathan

source: The new scheme means that the Common Points Scale used by the CAO to determine entry into higher education institutions, has also been revised
ga: Ciallaíonn an scéim nua go bhfuil an Scála Pointí Comónta a úsáideann an CAO chun iontráil ar institiúidí tríú leibhéil a mheas, athbhreithnithe

source: You can read more on transition.ie
ga: Is féidir a thuilleadh a léamh ar transition.ie

source: New grading scale for Leaving
ga: Scála Grádaithe Nua don Ardteist

source: ┃New grades* │% Marks ┃
ga: ┃Gráid nua* │% Marcanna ┃

source: ┃H1/O1 │90 - 100 ┃
ga: ┃A1/B1 │90 - 100 ┃

source: ┃H2/O2 │80 < 90 ┃
ga: ┃A2/B2 │80 < 90 ┃

source: ┃H3/O3 │70 < 80 ┃
ga: ┃A3/B3 │70 < 80 ┃

source: ┃H4/O4 │60 < 70 ┃
ga: ┃A4/B4 │60 < 70 ┃

source: ┃H5/O5 │50 < 60 ┃
ga: ┃A5/B5 │50 < 60 ┃

source: ┃H6/O6 │40 < 50 ┃
ga: ┃A6/B6 │40 < 50 ┃

source: ┃H7/O7 │30 <40 ┃
ga: ┃A7/B7 │30 <40 ┃

source: ┃H8/O8 │0 < 30 ┃
ga: ┃A8/B8 │0 < 30 ┃

source: Grades at Ordinary level are prefixed with O
ga: *Réimír A d'Ardleibhéil agus O do Bhunleibhéal

source: 85% but less than 90% A2
ga: │85% ach faoi bhun 90% │A2 │

source: 80% but less than 85% B1
ga: │80% ach faoi bhun 85% │B1 │

source: 75% but less than 80% B2
ga: │75% ach faoi bhun 80% │B2 │

source: 70% but less than 75% B3
ga: │70% ach faoi bhun 75% │B3 │

source: 65% but less than 70% C1
ga: │65% ach faoi bhun 70% │C1 │

source: 60% but less than 65% C2
ga: │60% ach faoi bhun 65% │C2 │

source: 55% but less than 60% C3
ga: │55% ach faoi bhun 60% │C3 │

source: 50% but less than 55% D1
ga: │50% ach faoi bhun 55% │D1 │

source: 45% but less than 50% D2
ga: │45% ach faoi bhun 50% │D2 │

source: 40% but less than 45% D3
ga: │40% ach faoi bhun 45% │D3 │

source: 25% but less than 40% E
ga: │25% ach faoi bhun 40% │E │

source: 10% but less than 25% F
ga: │10% ach faoi bhun 25% │F │

source: Less than 10% No grade
ga: │Faoi bhun 10% │Grád ar bith │

source: Obtaining a copy of your Leaving Certificate results
ga: Cóip de do thorthaí Ardteistiméireachta a fháil

source: You may be asked for evidence that you have completed State examinations when you apply for a job or for further education
ga: Féadfar an fhianaise sin a iarraidh ort nuair a chuireann tú isteach ar phost, nó nuair a chuireann tú isteach ar bhreisoideachas

source: It is always useful to have a copy of your results as well as the original Certificate, especially if you plan to work or study outside Ireland
ga: Tá sé áisiúil i gcónaí cóip de do thorthaí a bheith agat, chomh maith leis an Teastas féin, agus is féidir leis a bheith an-áisiúil má tá tú ag smaoineamh ar dhul i mbun cónaithe nó ag taisteal thar lear

source: The State Examinations Commission can provide you with a certified statement of your results - see 'How to apply' below
ga: Is féidir le Coimisiún na Scrúduithe Stáit ráiteas deimhnithe de do thorthaí a sholáthar duit - féach 'Conas iarratas a dhéanamh' thíos

source: Established Leaving Certificate examination fees for 2017 are:
ga: Is iad seo a leanas táillí scrúduithe na hArdteistiméireachta bunaithe don bhliain 2017:

source: First-time entry (school-based or external) 3 or more subjects €116
ga: │Iontráil chéaduaire 3+ ábhar │€116│

source: First-time entry (school-based or external) 1 or 2 subjects €71
ga: │Iontráil chéaduaire (1 nó 2 ábhar) │€71 │

source: School-based repeat entry €301
ga: │Athiontráil - scoil (3+ ábhar) │€301│

source: External candidates repeating the Leaving Certificate in 2017 pay fees on a sliding scale as follows:
ga: Íocann iarrthóirí seachtracha a bhíonn ag athdhéanamh na hArdteistiméireachta táillí ar scála comhghluaisteach mar seo a leanas:

source: There is a fee of €14.50 if you wish to obtain a copy of your Leaving Certificate results
ga: Tá táille €14.50 i gceist más mian leat cóip de thorthaí d’ardteistiméireachta a fháil

source: This fee does not apply to the most recent sittings of the examination
ga: Ní gá an táille seo a íoc más iad torthaí ó bhliain le gairid atá i gceist

source: Penalties for late applications
ga: Pionóis mar gheall ar iarratas a dhéanamh déanach

source: Applications received from non-school (external) applicants during the period 9 February to 28 February 2017 will be accepted on payment of a late fee of €32 per subject in addition to the normal fee
ga: Glactar iarratais ó iarratasóirí neamh-scoil (seachtrach) déanta idir 9 Feabhra agus 28 Feabhra 2017

source: A second late fee of €52 per subject in addition to the normal fee will apply to applications made from 1 March to 29 April 2017
ga: Ní ghlactar iarratais ó 1 Márta 2017 ach amháin in imthosca eisceachtúla

source: Entries for subjects with a practical, oral or project component will not be accepted at this stage
ga: Tá dara táille dhéanach de €52 ar gach ábhar de bhreis ar an gnáththáille le híoc

source: If you are a post-primary school student, your details will be sent to the State Examinations Commission by your school
ga: Más mac léinn iar-bhunscoile tú, cuirfidh do scoile do shonraí chuig Coimisiún na Scrúduithe Stáit

source: If you are an external (non-school) candidate for the established Leaving Certificate, you can apply online or on the application form available from the State Examinations Commission (SEC)
ga: Más iarrthóir seachtrach (iarrthóir neamhscoile) tú san Ardteistiméireacht bhunaithe, ba chóir d’iarratas ar líne nó i scríbhinn a bheith curtha chuig Coimisiún na Scrúduithe Stáit (CSS) faoin dáta deiridh

source: The closing date for applications is midnight on 8 February 2017
ga: Tosaíonn an chuid scríofa den Ardteistiméireacht Bhunaithe ar an 8 Meitheamh 2016

source: The written portion of the Leaving Certificate begins on 7 June 2017 and you can find the timetable for the written examinations (pdf) as well as the timetable for oral and practical examinations and submission of course work on the SEC website
ga: Tá an tráthchlár don Ardteistiméireacht Bhunaithe (pdf) agus an tráthchlár scrúduithe béil agus practiciúla (pdf) ar fáil ar an suíomh gréasáin CSS

source: Past Leaving Certificate examination papers and an information booklet for candidates (pdf) are also available on the SEC website
ga: Tá páipéir scrúdaithe Ardteistiméireachta agus leabhrán eolais don iarrthóir (pdf) ar fáil ar shuíomh gréasáin CSS

source: Applying for a copy of your exam results
ga: Iarratas a dhéanamh ar chóip de thorthaí do scrúduithe

source: To request a certified statement of examination results from the State Examinations Commission you can either apply online or download and complete an exam statement application form (pdf)
ga: Chun ráiteas deimhnithe de thorthaí scrúduithe a iarraidh ar Choimisiún na Scrúduithe Stáit is féidir leat iarratas a dhéanamh ar líne nó foirm iarratais le haghaidh ráiteas scrúduithe a íoslódáil agus a chomhlánú (pdf)

source: Your application should specify the following personal details:
ga: Ba chóir na sonraí pearsanta seo a leanas a shonrú san iarratas:

source: • Full name of the candidate
ga: • Ainm iomlán an iarrthóra

source: • Name at the time of the examination (if different)
ga: • Ainm tráth an scrúdaithe (más ainm éagsúil é)

source: • Name and address of school attended
ga: • Ainm agus seoladh na scoile ina raibh an t-iarrthóir

source: Paper application forms should be sent together with the fee of €14.50 (if applicable) to the State Examinations Commission at the address below
ga: Má roghnaigh tú foirm páipéir seachas iarratais ar líne, cuir an fhoirm chomhlánaithe mar aon leis an táille chuí €14.50 (más gá í) ar aghaidh chuig Coimisiún na Scrúduithe Stáit ag an seoladh thíos
